<script>
import common from './common'
export default {
  mixins: [common],
  data () {
    return {
      gameType: 'HC6',
      menus: [
        {
          title: '特码',
          groups: [
            {
              items: [
                {mutilpOrderPerRow: true, id: '1-1-1-HC6', title: '特码', description: '香港六合彩公司当期开出的最后一码为特别号或特码', example: '投注方案：08； 开奖号码最后一位为08，即中特码。'},
                {mutilpOrderPerRow: true, id: '1-1-2-HC6', title: '正码', description: '香港六合彩公司当期开出之前6个号码叫正码。每一个号码为一投注组合，假如投注号码为开奖号码之 正码，视为中奖，其余情形视为不中奖。', example: '投注方案：08；开奖号码前6位出现一次08， 即中正码'},
                {mutilpOrderPerRow: true, join: ',', id: '1-1-3-HC6', title: '特肖', description: '香港六合彩公司当期开出的最后一码为特别号或特码, 特码所属的生肖称为特肖', example: '投注方案：鼠； 开奖号码最后一位所属生肖为鼠，即中特肖。'},
                {mutilpOrderPerRow: true, join: ',', id: '3-1-1-HC6', title: '色波', description: '香港六合彩公司当期开出的最后一码为特别号或特码, 特码所属的色彩称为色波', example: '投注方案：红波； 开奖号码最后一位所属色彩为红波，即中色波。'}

                // {id: '1-1-3-HC6', title: '正码特', description: '正码特是指 正1特、正2特、正3特、正4特、正5特、正6特：其下注的正码特号与现场摇珠开出之正码其开奖顺序及开奖号码相同，视为中奖，如现场摇珠第一个正码开奖为49号，下注第一个正码特为49则视为中奖，其它号码视为不中奖。。', example: ''}
              ]
            }
          ]
        },
        {
          title: '连肖',
          groups: [
            {
              items: [
                {join: ',', id: '2-1-1-HC6', title: '2连肖', description: '依选择的连肖类别挑选 2 ～ 4 个生肖（排列如同生肖）为一个组合，当期的开奖号码 （六个正码及特码）座落于所勾选之生肖组合所属号码内，且所勾选之生肖皆至少有中一个号码，则视为中奖；其余情形一律视为不中奖；若选择的生肖组合内有包含本年生肖则称之为正肖，没有包含本年生肖则称之为平肖，正肖与平肖的中奖赔率不同(请注意49亦算输赢，不为和)。', example: '投注方案：鼠、虎；开奖号码中连续的2位出现[鼠虎]或[虎鼠]， 即中2连肖'},
                {join: ',', id: '2-1-2-HC6', title: '3连肖', description: '依选择的连肖类别挑选 2 ～ 4 个生肖（排列如同生肖）为一个组合，当期的开奖号码 （六个正码及特码）座落于所勾选之生肖组合所属号码内，且所勾选之生肖皆至少有中一个号码，则视为中奖；其余情形一律视为不中奖；若选择的生肖组合内有包含本年生肖则称之为正肖，没有包含本年生肖则称之为平肖，正肖与平肖的中奖赔率不同(请注意49亦算输赢，不为和)。', example: '投注方案：鼠、虎、龙；开奖号码中连续的3位出现[鼠虎龙]，顺序不限， 即中3连肖'},
                {join: ',', id: '2-1-3-HC6', title: '4连肖', description: '依选择的连肖类别挑选 2 ～ 4 个生肖（排列如同生肖）为一个组合，当期的开奖号码 （六个正码及特码）座落于所勾选之生肖组合所属号码内，且所勾选之生肖皆至少有中一个号码，则视为中奖；其余情形一律视为不中奖；若选择的生肖组合内有包含本年生肖则称之为正肖，没有包含本年生肖则称之为平肖，正肖与平肖的中奖赔率不同(请注意49亦算输赢，不为和)。', example: '投注方案：鼠、虎、龙、马；开奖号码中连续的4位出现[鼠虎龙马]，顺序不限， 即中4连肖'}
              ]
            }
          ]
        }
        // {
        //   title: '波色',
        //   groups: [
        //     {
        //       items: [
        //         {mutilpOrderPerRow: true, join: ',', id: '3-1-1-HC6', title: '波色', description: '', example: ''}
        //       ]
        //     }
        //   ]
        // }
      ],
      // 玩法信息
      type: {
        id: '1-1-1-HC6',
        // 玩法名
        title: '',
        // 玩法描述
        description: '',
        join: '|',
        mutilpOrderPerRow: true
      },
      lucknumbers: ['01', '01', '01', '01', '01', '01', '01'],
      getTitle () {
        switch (this.type.id.slice(0, 2)) {
          case '1-':
            return '特码'
          case '2-':
            return '连肖'
          case '3-':
            return '特码'
        }
      }
    }
  }
}
</script>
