<script>
import common from './common'
export default {
  mixins: [common],
  data () {
    return {
      gameType: 'PK10',
      menus: [
        {
          title: '猜冠亚军',
          groups: [
            {
              // title: '北京PK10',
              items: [
                {id: '-1-1-1-PK10', title: '猜冠军', description: '从01-10中共10个号码中选择1个号码，每注由1个号码组成，只要当期冠军号码为所选号码，即为中奖。', example: '投注方案：01； 开奖号码：01 * * * * * * * * * *，即中猜冠军。'},
                {id: '-1-1-2-PK10', title: '猜冠亚军', description: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前2个号码相同，且顺序一致，即为中奖。', example: '投注方案：01,02； 开奖号码：01 02 * * * * * * * * *，即中猜冠亚军。'}
              ]
            }
          ]
        },
        {
          title: '猜三四名',
          groups: [
            {
              // title: '北京PK10',
              items: [
                {id: '-1-1-3-PK10', title: '猜前三名', description: ' "从01-10共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码相同，且顺序一致，即为中奖。', example: '投注方案：01,02,03； 开奖号码：01 02 03 * * * * * * * *，即中猜三四名。'},
                {id: '-1-1-4-PK10', title: '猜前四名', description: ' "从01-10共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码相同，且顺序一致，即为中奖。', example: '投注方案：01,02,03,04； 开奖号码：01 02 03 04 * * * * * * *，即中猜前四名。'}
              ]
            }
          ]
        },
        {
          title: '趣味龙虎',
          groups: [
            {
              // title: '北京PK10',
              items: [
                // {id: '-1-1-1-PK10', title: '猜冠军', description: '从01-10中共10个号码中选择1个号码，每注由1个号码组成，只要当期冠军号码为所选号码，即为中奖。', example: ''},
                // {id: '-1-1-2-PK10', title: '猜冠亚军', description: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前2个号码相同，且顺序一致，即为中奖。', example: ''},
                // {id: '-1-1-3-PK10', title: '猜前三名', description: ' "从01-10共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码相同，且顺序一致，即为中奖。', example: ''},
                // {id: '-1-1-4-PK10', title: '猜前四名', description: ' "从01-10共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码相同，且顺序一致，即为中奖。', example: ''},
                // {id: '-1-1-5-PK10', title: '猜前五名', description: ' 从01-10共10个号码中选择5个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前5个号码相同，且顺序一致，即为中奖。', example: ''},
                {id: '-1-1-6-PK10', title: '龙虎', description: '第一名和最后一名比较，第一名大是龙，最后一名大是虎', example: '投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。'},
                {id: '-1-1-7-PK10', title: '定位胆', description: '', example: ''}
              ]
            }
          ]
        }
      ],
      // 玩法信息
      type: {
        id: '-1-1-1-PK10',
        // 玩法名
        title: '',
        // 玩法描述
        description: ''
      },
      getTitle () {
        switch (this.type.id.slice(0, 6)) {
          case '-1-1-1':
            return '猜冠亚军'
          case '-1-1-2':
            return '猜冠亚军'
          case '-1-1-3':
            return '猜三四名'
          case '-1-1-4':
            return '猜三四名'
          // case '-1-1-5':
          //   return '猜冠亚军'
          case '-1-1-6':
            return '趣味龙虎'
          case '-1-1-7':
            return '趣味龙虎'
        }
      }
    }
  }
}
</script>
