<script>
import common from './common'
export default {
  mixins: [common],
  data () {
    return {
      gameType: 'SSC',
      menus: [
        {
          title: '五星',
          groups: [
            {
              title: '直选',
              items: [
                {id: '5-1-1', title: '直选复式', description: '从万位、千位、百位、十位、个位中选择一个5位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：13456； 开奖号码：13456，即中五星直选。'},
                {id: '5-1-2', title: '直选单式', description: '手动输入一个5位数号码组成一注，所选号码的万位、千位、百位、十位、个位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：13456； 开奖号码：13456，即中五星直选。'},
                {id: '5-1-3', title: '直选组合', description: '从万位、千位、百位、十位、个位中至少各选一个号码组成1-5星的组合，共五注，所选号码的个位与开奖号码对应位相同，则中1个5等奖；所选号码的个位、十位与开奖号码对应位相同，则中1个5等奖以及1个4等奖，依此类推，最高可中5个奖。', example: '五星组合示例，如购买：4+5+6+7+8，该票共10元，由以下5注：45678(五星)、5678(四星)、678(三星)、78(二星)、8(一星)构成。开奖号码：45678，即可中五星、四星、三星、二星、一星各1注。'}
              ]
            },
            {
              title: '组选',
              items: [
                {id: '5-2-1', title: '组选120', description: '从0-9中任意选择5个号码组成一注，所选号码与开奖号码的万位、千位、百位、十位、个位相同，顺序不限，即为中奖。', example: '投注方案：10568，开奖号码：10568（顺序不限），即可中五星组选120。'},
                {id: '5-2-2', title: '组选60', description: '选择1个二重号码和3个单号号码组成一注，所选的单号号码与开奖号码相同，且所选二重号码在开奖号码中出现了2次，即为中奖。', example: '选择1个二重号码和3个单号号码组成一注，所选的单号号码与开奖号码相同，且所选二重号码在开奖号码中出现了2次，即为中奖。'},
                {id: '5-2-3', title: '组选30', description: '选择2个二重号和1个单号号码组成一注，所选的单号号码与开奖号码相同，且所选的2个二重号码分别在开奖号码中出现了2次，即为中奖。', example: '投注方案：二重号：68；单号：0，开奖号码：06688（顺序不限），即可中五星组选30。'},
                {id: '5-2-4', title: '组选20', description: '选择1个三重号码和2个单号号码组成一注，所选的单号号码与开奖号码相同，且所选三重号码在开奖号码中出现了3次，即为中奖。', example: '投注方案：三重号：8；单号：01，开奖号码：01888（顺序不限），即可中五星组选20。'},
                {id: '5-2-5', title: '组选10', description: '选择1个三重号码和1个二重号码，所选三重号码在开奖号码中出现3次，并且所选二重号码在开奖号码中出现了2次，即为中奖。', example: '投注方案：三重号：8；二重号：1，开奖号码：11888（顺序不限），即可中五星组选10。'},
                {id: '5-2-6', title: '组选5', description: '选择1个四重号码和1个单号号码组成一注，所选的单号存在于开奖号码中，且所选四重号码在开奖号码中出现了4次，即为中奖。', example: '投注方案：四重号：8；单号：1，开奖号码：18888（顺序不限），即可中五星组选5。'}
              ]
            },
            {
              title: '特殊',
              items: [
                {id: '5-3-1', title: '一帆风顺', description: '从0-9中任意选择1个号码组成一注，只要开奖号码的万位、千位、百位、十位、个位中包含所选号码，即为中奖。', example: '投注方案：8；开奖号码：至少出现1个8，即中一帆风顺。'},
                {id: '5-3-2', title: '好事成双', description: '从0-9中任意选择1个号码组成一注，只要所选号码在开奖号码的万位、千位、百位、十位、个位中出现2次，即为中奖。', example: '投注方案：8；开奖号码：至少出现2个8，即中好事成双。'},
                {id: '5-3-3', title: '三星报喜', description: '从0-9中任意选择1个号码组成一注，只要所选号码在开奖号码的万位、千位、百位、十位、个位中出现3次，即为中奖。', example: '投注方案：8；开奖号码：至少出现3个8，即中三星报喜。'},
                {id: '5-3-4', title: '四季发财', description: '从0-9中任意选择1个号码组成一注，只要所选号码在开奖号码的万位、千位、百位、十位、个位中出现4次，即为中奖。', example: '投注方案：8；开奖号码：至少出现4个8，即中四季发财。'}
              ]
            }
          ]
        },
        {
          title: '四星',
          groups: [
            {
              title: '前四直选',
              items: [
                {id: '4-1-1', title: '直选复式', description: '从万位、千位、百位、十位中选择一个4位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：3456； 开奖号码后四位：3456，即中四星直选。'},
                {id: '4-1-2', title: '直选单式', description: '手动输入一个4位数号码组成一注，所选号码的万位、千位、百位、十位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：3456； 开奖号码后四位：3456，即中四星直选'},
                {id: '4-1-3', title: '直选组合', description: '从万位、千位、百位、十位中至少各选一个号码组成1-4星的组合，共四注，所选号码的十位与开奖号码对应位相同，则中1个4等奖；所选号码的十位、百位与开奖号码对应位相同，则中1个4等奖以及1个3等奖，依此类推，最高可中4个奖。', example: '四星组合示例，如购买：5+6+7+8，该票共8元，由以下4注：5678(四星)、678(三星)、78(二星)、8(一星)构成。开奖号码：5678，即可中四星、三星、二星、一星各1注。'}
              ]
            },
            {
              title: '前四组选',
              items: [
                {id: '4-2-1', title: '组选24', description: '从0-9中任意选择4个号码组成一注，所选号码与开奖号码的万位、千位、百位、十位由0、5、6、8四个数字组成，顺序不限，即为中奖。', example: '投注方案：0568，开奖号码的千位、百位、十位、个位由0、5、6、8四个数字组成，顺序不限，即可中四星组选24。'},
                {id: '4-2-2', title: '组选12', description: '选择1个二重号码和2个单号号码组成一注，所选号码与开奖号码的万位、千位、百位、十位相同，且所选二重号码在开奖号码千位、百位、十位、个位中出现了2次，即为中奖。', example: '投注方案：二重号：8，单号：0、6，开奖的千位、百位、十位、个位由 0、6、8、8四个数字组成，顺序不限，即可中四星组选12。'},
                {id: '4-2-3', title: '组选6', description: '选择2个二重号码组成一注，所选的2个二重号码在开奖号码万位、千位、百位、十位分别出现了2次，即为中奖。', example: '选择2个二重号码组成一注，所选的2个二重号码在开奖号码万位、千位、百位、十位分别出现了2次，即为中奖。'},
                {id: '4-2-4', title: '组选4', description: '选择1个三重号码和1个单号号码组成一注，所选号码与开奖号码的万位、千位、百位、十位相同，且所选三重号码在开奖号码千位、百位、十位、个位中出现了3次，即为中奖。', example: '投注方案：三重号：8，单号：2，开奖的千位、百位、十位、个位由2、8、8、8四个数字组成，顺序不限，即可中四星组选4。'}
              ]
            },
            {
              title: '后四直选',
              items: [
                {id: '4-3-1', title: '直选复式', description: '从千位、百位、十位、个位中选择一个4位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：3456； 开奖号码后四位：3456，即中四星直选。'},
                {id: '4-3-2', title: '直选单式', description: '手动输入一个4位数号码组成一注，所选号码的千位、百位、十位、个位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：3456； 开奖号码后四位：3456，即中四星直选。'},
                {id: '4-3-3', title: '直选组合', description: '从千位、百位、十位、个位中至少各选一个号码组成1-4星的组合，共四注，所选号码的个位与开奖号码对应位相同，则中1个4等奖；所选号码的个位、十位与开奖号码对应位相同，则中1个4等奖以及1个3等奖，依此类推，最高可中4个奖', example: '四星组合示例，如购买：5+6+7+8，该票共8元，由以下4注：5678(四星)、678(三星)、78(二星)、8(一星)构成。开奖号码：5678，即可中四星、三星、二星、一星各1注。'}
              ]
            },
            {
              title: '后四组选',
              items: [
                {id: '4-4-1', title: '组选24', description: '从0-9中任意选择4个号码组成一注，所选号码与开奖号码的千位、百位、十位、个位由0、5、6、8四个数字组成，顺序不限，即为中奖。', example: '投注方案：0568，开奖号码的千位、百位、十位、个位由0、5、6、8四个数字组成，顺序不限，即可中四星组选24。'},
                {id: '4-4-2', title: '组选12', description: '选择1个二重号码和2个单号号码组成一注，所选号码与开奖号码的千位、百位、十位、个位相同，且所选二重号码在开奖号码千位、百位、十位、个位中出现了2次，即为中奖。', example: '投注方案：二重号：8，单号：0、6，开奖的千位、百位、十位、个位由 0、6、8、8四个数字组成，顺序不限，即可中四星组选12。'},
                {id: '4-4-3', title: '组选6', description: '选择2个二重号码组成一注，所选的2个二重号码在开奖号码千位、百位、十位、个位分别出现了2次，即为中奖。', example: '投注方案：二重号：2、8，开奖的千位、百位、十位、个位由2、2、8、8四个数字组成，顺序不限，即可中四星组选6。'},
                {id: '4-4-4', title: '组选4', description: '选择1个三重号码和1个单号号码组成一注，所选号码与开奖号码的千位、百位、十位、个位相同，且所选三重号码在开奖号码千位、百位、十位、个位中出现了3次，即为中奖。', example: '投注方案：三重号：8，单号：2，开奖的千位、百位、十位、个位由2、8、8、8四个数字组成，顺序不限，即可中四星组选4。'}
              ]
            }
          ]
        },
        {
          title: '前三',
          groups: [
            {
              title: '前三直选',
              items: [
                {id: '+3-1-1', title: '直选复式', description: '从万位、千位、百位中选择一个3位数号码组成一注，所选号码与开奖号码的前3位相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码前三位：345，即中前三直选。'},
                {id: '+3-1-2', title: '直选单式', description: '手动输入一个3位数号码组成一注，所选号码的万位、千位、百位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码前三位：345，即中前三直选。'},
                {id: '+3-1-3', title: '直选和值', description: '所选数值等于开奖号码的万位、千位、百位三个数字相加之和，即为中奖。', example: '投注方案：和值1；开奖号码前三位：001,010,100,即中前三直选。'},
                {id: '+3-1-4', title: '直选跨度', description: '所选数值等于开奖号码的前3位最大与最小数字相减之差，即为中奖。', example: '投注方案：跨度8；开奖号码前三位：(1)开出的三个数字包括0,8,x，其中x≠9，即可中前三直选;(2)开出的三个数字包括1,9,x，其中x≠0，即可中前三直选。'}
              ]
            },
            {
              title: '前三组选',
              items: [
                {id: '+3-2-1', title: '组三复式', description: '从0-9中选择2个数字组成两注，所选号码与开奖号码的万位、千位、百位相同，且顺序不限，即为中奖。 ', example: '投注方案：5,8,8；开奖号码前三位：1个5，2个8 (顺序不限)，即中前三组三'},
                {id: '+3-2-2', title: '组三单式', description: '手动输入一个3位数号码组成一注，开奖号码的万位、千位、百位相同，顺序不限，且符合组三为中奖。', example: '投注方案：5,8,8；开奖号码前三位：1个5，2个8 (顺序不限)，即中前三组三'},
                {id: '+3-2-3', title: '组六复式', description: '从0-9中任意选择3个号码组成一注，所选号码与开奖号码的万位、千位、百位相同，顺序不限，即为中奖。', example: '投注方案：2,5,8；开奖号码前三位：1个2、1个5、1个8 (顺序不限)，即中前三组六。'},
                {id: '+3-2-4', title: '组六单式', description: '手动输入一个3位数号码组成一注，开奖号码的万位、千位、百位相同，顺序不限，且符合组六为中奖。', example: '投注方案：2,5,8；开奖号码前三位：1个2、1个5、1个8 (顺序不限)，即中前三组六。'},
                {id: '+3-2-5', title: '混合组选', description: '手动输入一个3位数号码组成一注(不含豹子号)，开奖号码的万位、千位、百位符合前三组三或组六均为中奖', example: '投注方案：分別投注(0,0,1),以及(1,2,3)，开奖号码前三位包括：(1)0,0,1，顺序不限，即中得组三；或者(2)1,2,3，顺序不限，即中得组六。'}
              ]
            },
            {
              title: '前三其它',
              items: [
                {id: '+3-3-1', title: '和值(不含豹子号)', description: '所选数值等于开奖号码万位、千位、百位三个数字相加之和(不含豹子号)，即为中奖。', example: '投注方案：和值3；开奖号码前三位：(1)开出003号码，顺序不限，即中前三组三；(2)开出012号码，顺序不限，即中前三组六。'},
                {id: '+3-3-2', title: '包胆((不含豹子号)', description: '从0-9中任意选择1个包胆号码，开奖号码的万位、千位、百位中任意1位只要和所选包胆号码相同(不含豹子号)，即为中奖。', example: '投注方案：包胆3；开奖号码后三位：(1)出现3xx或者33x,即中前三组三；(2)出现3xy，即中前三组六。'},
                {id: '+3-3-3', title: '和值尾数', description: '所选数值等于开奖号码的万位、千位、百位三个数字相加之和的尾数，即为中奖。', example: '投注方案：和值尾数8，开奖号码：前三位和值尾数为8，即中得和值尾数。'},
                {id: '+3-3-4', title: '特殊号', description: '所选的号码特殊属性和开奖号码前3位的属性一致，即为中奖。其中：1.豹子号指的是开奖号码的前三位当中，三位数号码数字全部相同；2.顺子号的万、千、百位不分顺序(特别号码：019、089也是顺子号)；3.对子号指的是开奖号码的前三位当中，任意2位数字相同的三位数号码。', example: '豹子；开奖号码前三位：三个数字全部相同，即中得豹子，顺子；开奖号码前三位：为连续数字，例如678，即中得顺子。对子；开奖号码前三位：3个数字中有2个数字相同，即中得对子'}
              ]
            }
          ]
        },
        {
          title: '中三',
          groups: [
            {
              title: '中三直选',
              items: [
                {id: '3-1-1', title: '直选复式', description: '从千位、百位、十位中选择一个3位数号码组成一注，所选号码与开奖号码的中间3位相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码中三位：345，即中中三直选。'},
                {id: '3-1-2', title: '直选单式', description: '手动输入一个3位数号码组成一注，所选号码的千位、百位、十位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码中三位：345，即中中三直选。'},
                {id: '3-1-3', title: '直选和值', description: '所选数值等于开奖号码的千位、百位、十位三个数字相加之和，即为中奖。', example: '投注方案：和值1；开奖号码中三位：001,010,100,即中中三直选。'},
                {id: '3-1-4', title: '直选跨度', description: '所选数值等于开奖号码的前3位最大与最小数字相减之差，即为中奖。', example: '投注方案：跨度8；开奖号码中三位：(1)开出的三个数字包括0,8,x，其中x≠9，即可中中三直选;(2)开出的三个数字包括1,9,x，其中x≠0，即可中中三直选。'}
              ]
            },
            {
              title: '中三组选',
              items: [
                {id: '3-2-1', title: '组三复式', description: '从0-9中选择2个数字组成两注，所选号码与开奖号码的千位、百位、十位相同，且顺序不限，即为中奖。', example: '投注方案：5,8,8；开奖号码中三位：1个5，2个8 (顺序不限)，即中中三组三。'},
                {id: '3-2-2', title: '组三单式', description: '手动输入一个3位数号码组成一注，开奖号码的千位、百位、十位相同，顺序不限，且符合组三为中奖。', example: '投注方案：5,8,8；开奖号码中三位：1个5，2个8 (顺序不限)，即中中三组三。'},
                {id: '3-2-3', title: '组六复式', description: '从0-9中任意选择3个号码组成一注，所选号码与开奖号码的千位、百位、十位相同，顺序不限，即为中奖。', example: '投注方案：2,5,8；开奖号码中三位：1个2、1个5、1个8 (顺序不限)，即中中三组六。'},
                {id: '3-2-4', title: '组六单式', description: '手动输入一个3位数号码组成一注，开奖号码的千位、百位、十位相同，顺序不限，且符合组六为中奖。', example: '投注方案：2,5,8；开奖号码中三位：1个2、1个5、1个8 (顺序不限)，即中中三组六。'},
                {id: '3-2-5', title: '混合组选', description: '手动输入一个3位数号码组成一注(不含豹子号)，开奖号码的千位、百位、十位符合中三组三或组六均为中奖。', example: '投注方案：分別投注(0,0,1),以及(1,2,3)，开奖号码中三位包括：(1)0,0,1，顺序不限，即中得组三；或者(2)1,2,3，顺序不限，即中得组六。'}
              ]
            },
            {
              title: '中三其它',
              items: [
                {id: '3-3-1', title: '和值(不含豹子号)', description: '所选数值等于开奖号码千位、百位、十位三个数字相加之和(不含豹子号)，即为中奖。', example: '投注方案：和值3；开奖号码中三位：(1)开出003号码，顺序不限，即中中三组三；(2)开出012号码，顺序不限，即中中三组六。'},
                {id: '3-3-2', title: '包胆(不含豹子号)', description: '从0-9中任意选择1个包胆号码，开奖号码的千位、百位、十位中任意1位只要和所选包胆号码相同(不含豹子号)，即为中奖。', example: '投注方案：包胆3；开奖号码后三位：(1)出现3xx或者33x,即中中三组三；(2)出现3xy，即中中三组六。'},
                {id: '3-3-3', title: '和值尾数', description: '所选数值等于开奖号码的千位、百位、十位三个数字相加之和的尾数，即为中奖。', example: '投注方案：和值尾数8，开奖号码：中三位和值尾数为8，即中得和值尾数。'},
                {id: '3-3-4', title: '特殊号', description: '所选的号码特殊属性和开奖号码中间3位的属性一致，即为中奖。其中：1.豹子号指的是开奖号码的中三位当中，三位数号码数字全部相同；2.顺子号的万、千、百位不分顺序(特别号码：019、089也是顺子号)；3.对子号指的是开奖号码的中三位当中，任意2位数字相同的三位数号码', example: '豹子；开奖号码中三位：三个数字全部相同，即中得豹子，顺子；开奖号码中三位：为连续数字，例如678，即中得顺子。对子；开奖号码中三位：3个数字中有2个数字相同，即中得对子'}
              ]
            }
          ]
        },
        {
          title: '后三',
          groups: [
            {
              title: '后三直选',
              items: [
                {id: '-3-1-1', title: '直选复式', description: '从百位、十位、个位中选择一个3位数号码组成一注，所选号码与开奖号码的后3位相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码后三位：345，即中中三直选。'},
                {id: '-3-1-2', title: '直选单式', description: '手动输入一个3位数号码组成一注，所选号码的百位、十位、个位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码后三位：345，即中中三直选。'},
                {id: '-3-1-3', title: '直选和值', description: '所选数值等于开奖号码的百位、十位、个位三个数字相加之和，即为中奖。', example: '投注方案：和值1；开奖号码后三位：001,010,100,即中后三直选。'},
                {id: '-3-1-4', title: '直选跨度', description: '所选数值等于开奖号码的后3位最大与最小数字相减之差，即为中奖。', example: '投注方案：跨度8；开奖号码后三位：(1)开出的三个数字包括0,8,x，其中x≠9，即可中后三直选;(2)开出的三个数字包括1,9,x，其中x≠0，即可中后三直选。'}
              ]
            },
            {
              title: '后三组选',
              items: [
                {id: '-3-2-1', title: '组三复式', description: '从0-9中选择2个数字组成两注，所选号码与开奖号码的百位、十位、个位相同，且顺序不限，即为中奖。', example: '投注方案：5,8,8；开奖号码后三位：1个5，2个8 (顺序不限)，即中后三组三。'},
                {id: '-3-2-2', title: '组三单式', description: '手动输入一个3位数号码组成一注，开奖号码的百位、十位、个位相同，顺序不限，且符合组三为中奖。', example: '投注方案：5,8,8；开奖号码后三位：1个5，2个8 (顺序不限)，即中后三组三。'},
                {id: '-3-2-3', title: '组六复式', description: '从0-9中任意选择3个号码组成一注，所选号码与开奖号码的百位、十位、个位相同，顺序不限，即为中奖。', example: '投注方案：2,5,8；开奖号码后三位：1个2、1个5、1个8 (顺序不限)，即中后三组六。'},
                {id: '-3-2-4', title: '组六单式', description: '手动输入一个3位数号码组成一注，开奖号码的百位、十位、个位相同，顺序不限，且符合组六为中奖。', example: '投注方案：2,5,8；开奖号码后三位：1个2、1个5、1个8 (顺序不限)，即中后三组六。'},
                {id: '-3-2-5', title: '混合组选', description: '手动输入一个3位数号码组成一注(不含豹子号)，开奖号码的百位、十位、个位符合后三组三或组六均为中奖。', example: '投注方案：分別投注(0,0,1),以及(1,2,3)，开奖号码后三位包括：(1)0,0,1，顺序不限，即中得组三；或者(2)1,2,3，顺序不限，即中得组六。'}
              ]
            },
            {
              title: '后三其它',
              items: [
                {id: '-3-3-1', title: '和值(不含豹子号)', description: '所选数值等于开奖号码百位、十位、个位三个数字相加之和(不含豹子号)，即为中奖。', example: '投注方案：和值3；开奖号码后三位：(1)开出003号码，顺序不限，即中后三组三；(2)开出012号码，顺序不限，即中后三组六。'},
                {id: '-3-3-2', title: '包胆(不含豹子号)', description: '从0-9中任意选择1个包胆号码，开奖号码的百位、十位、个位中任意1位只要和所选包胆号码相同(不含豹子号)，即为中奖。', example: '投注方案：包胆3；开奖号码后三位：(1)出现3xx或者33x,即中后三组三；(2)出现3xy，即中后三组六。'},
                {id: '-3-3-3', title: '和值尾数', description: '所选数值等于开奖号码的百位、十位、个位三个数字相加之和的尾数，即为中奖。', example: '投注方案：和值尾数8，开奖号码：后三位和值尾数为8，即中得和值尾数。'},
                {id: '-3-3-4', title: '特殊号', description: '所选的号码特殊属性和开奖号码中间3位的属性一致，即为中奖。其中：1.豹子号指的是开奖号码的后三位当中，三位数号码数字全部相同；2.顺子号的万、千、百位不分顺序(特别号码：019、089也是顺子号)；3.对子号指的是开奖号码的后三位当中，任意2位数字相同的三位数号码', example: '豹子；开奖号码后三位：三个数字全部相同，即中得豹子，顺子；开奖号码后三位：为连续数字，例如678，即中得顺子。对子；开奖号码中三位：3个数字中有2个数字相同，即中得对子'}
              ]
            }
          ]
        },
        {
          title: '二星',
          groups: [
            {
              title: '前二直选',
              items: [
                {id: '2-1-1', title: '直选复式', description: '从万位、千位中选择一个2位数号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。 ', example: '投注方案：58；开奖号码前二位：58，即中前二直选。'},
                {id: '2-1-2', title: '直选单式', description: '手动输入一个2位数号码组成一注，所选号码的万位、千位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：58；开奖号码前二位：58，即中前二直选。'},
                {id: '2-1-3', title: '直选跨度', description: '所选数值等于开奖号码的前2位最大与最小数字相减之差，即为中奖。', example: '投注方案：跨度9；开奖号码为9,0,-,-,-或0,9,-,-,-，即中前二直选。'}
              ]
            },
            {
              title: '前二组选',
              items: [
                {id: '2-2-1', title: '组选复式', description: '从0-9中选2个号码组成一注，所选号码与开奖号码的万位、千位相同，顺序不限（不含对子号），即中奖。 ', example: '投注方案：5,8；开奖号码前二位：85 或58(顺序不限，不含对子号)，即中前二组选。'},
                {id: '2-2-2', title: '组选单式', description: '手动输入一个2位数号码组成一注，所选号码的万位、千位与开奖号码相同，顺序不限（不含对子号），即为中奖。', example: '投注方案：5,8；开奖号码前二位：85 或58(顺序不限，不含对子号)，即中前二组选。'},
                {id: '2-2-3', title: '组选包胆', description: '从0-9中任意选择1个包胆号码，开奖号码的万位、千位中任意1位包含所选的包胆号码相同（不含对子号），即为中奖。', example: '投注方案：包胆号码8；开奖号码前二位：出现1个8（不包括2个8），即中前二组选。'}
              ]
            },
            {
              title: '后二直选',
              items: [
                {id: '2-3-1', title: '直选复式', description: '从十位、个位中选择一个2位数号码组成一注，所选号码与开奖号码的后2位相同，且顺序一致，即为中奖。 ', example: '投注方案：58；开奖号码后二位：58，即中后二直选。'},
                {id: '2-3-2', title: '直选单式', description: '手动输入一个2位数号码组成一注，所选号码的十位、个位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：58；开奖号码后二位：58，即中后二直选。'},
                {id: '2-3-3', title: '直选跨度', description: '所选数值等于开奖号码的后2位最大与最小数字相减之差，即为中奖。', example: '投注方案：跨度9；开奖号码为9,0,-,-,-或0,9,-,-,-，即中后二直选。'}
              ]
            },
            {
              title: '后二组选',
              items: [
                {id: '2-4-1', title: '组选复式', description: '从0-9中选2个号码组成一注，所选号码与开奖号码的十位、个位相同，顺序不限（不含对子号），即中奖。 ', example: '投注方案：5,8；开奖号码后二位：85 或58(顺序不限，不含对子号)，即中后二组选。'},
                {id: '2-4-2', title: '组选单式', description: '手动输入一个2位数号码组成一注，所选号码的十位、个位与开奖号码相同，顺序不限（不含对子号），即为中奖。', example: '投注方案：5,8；开奖号码后二位：85 或58(顺序不限，不含对子号)，即中后二组选。'},
                {id: '2-4-3', title: '组选包胆', description: '从0-9中任意选择1个包胆号码，开奖号码的十位、个位中任意1位包含所选的包胆号码相同（不含对子号），即为中奖。', example: '投注方案：包胆号码8；开奖号码后二位：出现1个8（不包括2个8），即中后二组选。'}
              ]
            }
          ]
        },
        {
          title: '一星',
          groups: [
            {
              // title: '前二直选',
              items: [
                {id: '1-1-1', title: '定位胆', description: '从万位、千位、百位、十位、个位任意位置上至少选择1个以上号码，所选号码与相同位置上的开奖号码一致，即为中奖。', example: '投注方案：万位 1；开奖号码万位：1，即中定位胆万位。'}
              ]
            }
          ]
        },
        {
          title: '不定位',
          groups: [
            {
              title: '三星',
              items: [
                {id: '0-1-1', title: '前三一码', description: '从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的万位、千位、百位中包含所选号码，即为中奖', example: '投注方案：1；开奖号码前三位：至少出现1个1，即中前三一码不定位。'},
                {id: '0-1-2', title: '前三二码', description: '从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的万位、千位、百位中同时包含所选的2个号码，即为中奖', example: '投注方案：1,2；开奖号码前三位：至少出现1和2各1个，即中前三二码不定位。'},
                {id: '0-1-3', title: '中三一码', description: '从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的千位、百位、十位中包含所选号码，即为中奖。', example: '投注方案：1；开奖号码前三位：至少出现1个1，即中前三一码不定位。'},
                {id: '0-1-4', title: '中三二码', description: '从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的千位、百位、十位中同时包含所选的2个号码，即为中奖', example: '投注方案：1,2；开奖号码前三位：至少出现1和2各1个，即中前三二码不定位。'},
                {id: '0-1-5', title: '后三一码', description: '从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的百位、十位、个位中包含所选号码，即为中奖。', example: '投注方案：1；开奖号码后三位：至少出现1个1，即中后三一码不定位。'},
                {id: '0-1-6', title: '后三二码', description: '从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的百位、十位、个位中同时包含所选的2个号码，即为中奖。', example: '投注方案：1,2；开奖号码后三位：至少出现1和2各1个，即中后三二码不定位。'}
              ]
            },
            {
              title: '四星',
              items: [
                {id: '0-2-1', title: '前四一码', description: '从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的万位、千位、百位、十位中包含所选号码，即为中奖。', example: '投注方案：1；开奖号码后四位：至少出现1个1，即中四星一码不定位。'},
                {id: '0-2-2', title: '前四二码', description: '从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的万位、千位、百位、十位中同时包含所选的2个号码，即为中奖。', example: '投注方案：1,2；开奖号码后四位：至少出现1和2各1个，即中四星二码不定位。'},
                {id: '0-2-3', title: '后四一码', description: '从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的千位、百位、十位、个位中包含所选号码，即为中奖。', example: '投注方案：1；开奖号码后四位：至少出现1个1，即中四星一码不定位。'},
                {id: '0-2-4', title: '后四二码', description: '从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的千位、百位、十位、个位中同时包含所选的2个号码，即为中奖。', example: '投注方案：1,2；开奖号码后四位：至少出现1和2各1个，即中四星二码不定位。'}
              ]
            },
            {
              title: '五星',
              items: [
                {id: '0-3-1', title: '五星二码', description: '从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的万位、千位、百位、十位、个位中同时包含所选的2个号码，即为中奖。', example: '投注方案：1,2；开奖号码：至少出现1和2各1个，即中五星二码不定位。'},
                {id: '0-3-2', title: '五星三码', description: '从0-9中选择3个号码，每注由3个不同的号码组成，开奖号码的万位、千位、百位、十位、个位中同时包含所选的3个号码，即为中奖。', example: '投注方案：1,2,3；开奖号码：至少出现1、2、3各1个，即中五星三码不定位。'}
              ]
            }
          ]
        },
        {
          title: '任选',
          groups: [
            {
              title: '任二',
              items: [
                {id: '-1-1-1', title: '直选复式', description: '从万位、千位、百位、十位、个位中任意选择两个位，在这两个位上至少各选1个号码组成一注，所选2个位置上的开奖号码与所选号码完全相同，且顺序一致，即为中奖。', example: '投注方案：万位1，十位2； 开奖号码：1**2*，即中任二直选。'},
                {id: '-1-1-2', title: '直选单式', description: '从万位、千位、百位、十位、个位中任意勾选两个位置，手动输入一个两位数号码组成一注，所选2个位置和输入的号码都与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：勾选位置千位、个位，输入号码12； 开奖号码：*1**2，即中任二直选。'},
                {id: '-1-1-3', title: '组选复式', description: '从万位、千位、百位、十位、个位中任意勾选两个位置，然后从0-9中选择两个号码组成一注，所选2个位置的开奖号码与所选号码一致，顺序不限，即为中奖。', example: '投注方案：勾选位置万位、个位，选择号码79； 开奖号码：9***7 或 7***9，均中任二组选。'},
                {id: '-1-1-4', title: '组选单式', description: '从万位、千位、百位、十位、个位中任意勾选两个位置，然后输入两个号码组成一注，所选2个位置的开奖号码与输入号码一致，顺序不限，即为中奖。', example: '投注方案：勾选位置万位、个位，输入号码79； 开奖号码：9***7 或 7***9，均中任二组选。'}
              ]
            },
            {
              title: '任三',
              items: [
                {id: '-1-2-1', title: '直选复式', description: '从万位、千位、百位、十位、个位中任意选择三个位，在这三个位上至少各选1个号码组成一注，所选3个位置上的开奖号码与所选号码完全相同，且顺序一致，即为中奖。', example: '投注方案：万位1、千位5、十位2； 开奖号码：15*2*，即中任三直选。'},
                {id: '-1-2-2', title: '直选单式', description: '从万位、千位、百位、十位、个位中任意勾选三个位置，手动输入一个三位数号码组成一注，所选三个位置上的开奖号码与输入号码完全相同，且顺序一致，即为中奖。', example: '投注方案：勾选位置万位、千位、个位，输入号码152； 开奖号码：15**2，即中任三直选。'},
                {id: '-1-2-3', title: '组三复式', description: '从万位、千位、百位、十位、个位中任意勾选三个位置，然后从0-9中选择两个号码组成一注，所选3个位置的开奖号码与所选号码一致，顺序不限，即为中奖。', example: '投注方案：勾选位置万位、千位、个位，选择号码18； 开奖号码：11**8 或 18**1，均中任三组三。'},
                {id: '-1-2-4', title: '组三单式', description: '从万位、千位、百位、十位、个位中任意勾选三个位置，然后输入两个号相同号码和一个不同号码组成一注，所选3个位置的开奖号码与输入号码一致，顺序不限，即为中奖。', example: '投注方案：勾选位置万位、千位、个位，输入号码779； 开奖号码：97**7 或 79**7，均中任三组三。'},
                {id: '-1-2-5', title: '组六复式', description: '从万位、千位、百位、十位、个位中任意勾选三个位置，然后从0-9中选择三个号码组成一注，所选3个位置的开奖号码与所选号码一致，顺序不限，即为中奖。', example: '投注方案：勾选位置万位、百位、个位，选择号码159； 开奖号码：1*5*9 或 9*1*5，均中任三组六。'},
                {id: '-1-2-6', title: '组六单式', description: '从万位、千位、百位、十位、个位中任意勾选三个位置，然后输入三个各不相同的3个号码组成一注，所选3个位置的开奖号码与输入号码一致，顺序不限，即为中奖。', example: '投注方案：勾选位置万位、百位、个位，选择号码159； 开奖号码：1*5*9 或 9*1*5，即中任三组六。'},
                {id: '-1-2-7', title: '混合组选', description: '从万位、千位、百位、十位、个位中任意勾选三个位置，然后输入三个号码组成一注，所选3个位置的开奖号码与输入号码一致，顺序不限，即为中奖。', example: '投注方案：勾选位置千位、百位、个位，分別投注(0,0,1),以及(1,2,3)，开奖号码：*00*1，顺序不限，即中任三组三；或者(2)*21*3，顺序不限，即中任三组六。'}
              ]
            },
            {
              title: '任四',
              items: [
                {id: '-1-3-1', title: '直选复式', description: '从万位、千位、百位、十位、个位中任意选择四个位置，在这四个位上至少各选1个号码组成一注，所选4个位置上的开奖号码与所选号码完全相同，且顺序一致，即为中奖。', example: '投注方案：万位1、千位5、百位0、十位2； 开奖号码：1502*，即中任四直选。'},
                {id: '-1-3-2', title: '直选单式', description: '从万位、千位、百位、十位、个位中任意勾选四个位置，手动输入一个四位数号码组成一注，所选4个位置上的开奖号码与输入号码完全相同，且顺序一致，即为中奖。', example: '投注方案：勾选位置万位、千位、十位、个位，输入号码1524； 开奖号码：15*24，即中任四直选。'},
                {id: '-1-3-3', title: '组选24', description: '从万位、千位、百位、十位、个位中任意勾选四个位置，然后从0-9中选择四个号码组成一注，所选4个位置的开奖号码与所选号码一致，顺序不限，即为中奖。', example: '投注方案：勾选位置万位、千位、十位、个位，选择号码1234； 开奖号码：12*34 或 13*24，均中任四组选24。'},
                {id: '-1-3-4', title: '组选12', description: '从万位、千位、百位、十位、个位中任意勾选四个位置，然后选择1个二重号码和2个单号号码组成一注，所选4个位置的开奖号码中包含与所选号码，且所选二重号码在所选4个位置的开奖号码中出现了2次，即为中奖。', example: '投注方案：勾选位置万位、千位、十位、个位，选择二重号：8，单号：0、6； 开奖号码：88*06 或 08*68，均中任四组选12。'},
                {id: '-1-3-5', title: '组选6', description: '从万位、千位、百位、十位、个位中任意勾选四个位置，然后从0-9中选择2个二重号组成一注，所选4个位置的开奖号码与所选号码一致，并且所选的2个二重号码在所选4个位置的开奖号码中分别出现了2次，顺序不限，即为中奖。', example: '投注方案：勾选位置万位、千位、十位、个位，选择二重号：6、8； 开奖号码：66*88 或 68*68，均中任四组选6。'},
                {id: '-1-3-6', title: '组选4', description: '从万位、千位、百位、十位、个位中任意勾选四个位置，然后从0-9中选择1个三重号和1个单号组成一注，所选4个位置的开奖号码与所选号码一致，并且所选三重号码在所选4个位置的开奖号码中出现了3次，顺序不限，即为中奖。', example: '投注方案：勾选位置万位、千位、十位、个位，选择三重号：8，单号：0； 开奖号码：88*80 或 80*88，均中任四组选4。'}
              ]
            }
          ]
        },
        {
          title: '趣味',
          groups: [
            {
              title: '大小单双',
              items: [
                {id: '-2-1-1', title: '前二大小单双', description: '对万位、千位的“大（56789）小（01234）、单（13579）双（02468）”形态进行购买，所选号码的位置、形态与开奖号码的位置、形态相同，即为中奖。', example: '投注方案：小双；开奖号码万位与千位：小双，即中前二大小单双。'},
                {id: '-2-1-2', title: '后二大小单双', description: '对十位和个位的“大（56789）小（01234）、单（13579）双（02468）”形态进行购买，所选号码的位置、形态与开奖号码的位置、形态相同，即为中奖。', example: '投注方案：大单；开奖号码十位与个位：大单，即中后二大小单双。'}
              ]
            },
            {
              title: '猜遗漏',
              items: [
                {id: '-2-2-1', title: '猜一', description: '在0-9共10个号码中任选1个号码为一注，当期开出的5个号码中没有出现所选号码即为中奖', example: '投注方案：1，开奖号码23456，即中奖'},
                {id: '-2-2-2', title: '猜二', description: '在0-9共10个号码中任选2个号码为一注，当期开出的5个号码中没有出现所选号码即为中奖', example: '投注方案：12，开奖号码34567，即中奖'},
                {id: '-2-2-3', title: '猜三', description: '在0-9共10个号码中任选3个号码为一注，当期开出的5个号码中没有出现所选号码即为中奖', example: '投注方案：123，开奖号码45678，即中奖'},
                {id: '-2-2-4', title: '猜四', description: '在0-9共10个号码中任选4个号码为一注，当期开出的5个号码中没有出现所选号码即为中奖', example: '投注方案：1234，开奖号码56789，即中奖'},
                {id: '-2-2-5', title: '猜五', description: '在0-9共10个号码中任选5个号码为一注，当期开出的5个号码中没有出现所选号码即为中奖', example: '投注方案：12345，开奖号码06789，即中奖'}
              ]
            }
          ]
        }
      ],
      getTitle () {
        switch (this.type.id.slice(0, 2)) {
          case '5-':
            return '五星'
          case '4-':
            return '四星'
          case '3-':
            return '中三'
          case '-3':
            return '后三'
          case '+3':
            return '前三'
          case '2-':
            return '二星'
          case '1-':
            return '一星'
          case '0-':
            return '不定位'
          case '-1':
            return '任选'
          case '-2':
            return '趣味'
        }
      },
      // 玩法信息
      type: {
        id: '5-1-1',
        // 玩法名
        title: '',
        // 玩法描述
        description: ''
      }
    }
  }
}
</script>
