<script>
import common from './common'
export default {
  mixins: [common],
  data () {
    return {
      gameType: 'SSL',
      menus: [
        // {
        //   title: '后三',
        //   groups: [
        //     {
        //       title: '后三直选',
        //       items: [
        //         {id: '-3-1-1', title: '直选复式', description: '从百位、十位、个位中选择一个3位数号码组成一注，所选号码与开奖号码的后3位相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码前三位：345，即中中三直选。'},
        //         {id: '-3-1-2', title: '直选单式', description: '手动输入一个3位数号码组成一注，所选号码的百位、十位、个位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码中三位：345，即中中三直选。'},
        //         {id: '-3-1-3', title: '直选和值', description: '所选数值等于开奖号码的百位、十位、个位三个数字相加之和，即为中奖。', example: '投注方案：和值1；开奖号码中三位：001,010,100,即中中三直选。'},
        //         {id: '-3-1-4', title: '直选跨度', description: '所选数值等于开奖号码的后3位最大与最小数字相减之差，即为中奖。', example: '投注方案：跨度8；开奖号码后三位：(1)开出的三个数字包括0,8,x，其中x≠9，即可中后三直选;(2)开出的三个数字包括1,9,x，其中x≠0，即可中后三直选。'}
        //       ]
        //     },
        //     {
        //       title: '后三组选',
        //       items: [
        //         {id: '-3-2-1', title: '组三复式', description: '从0-9中选择2个数字组成两注，所选号码与开奖号码的百位、十位、个位相同，且顺序不限，即为中奖。', example: '投注方案：5,8,8；开奖号码后三位：1个5，2个8 (顺序不限)，即中后三组三。'},
        //         {id: '-3-2-2', title: '组三单式', description: '手动输入一个3位数号码组成一注，开奖号码的百位、十位、个位相同，顺序不限，且符合组三为中奖。', example: '投注方案：5,8,8；开奖号码后三位：1个5，2个8 (顺序不限)，即中后三组三。'},
        //         {id: '-3-2-3', title: '组六复式', description: '从0-9中任意选择3个号码组成一注，所选号码与开奖号码的百位、十位、个位相同，顺序不限，即为中奖。', example: '投注方案：2,5,8；开奖号码后三位：1个2、1个5、1个8 (顺序不限)，即中后三组六。'},
        //         {id: '-3-2-4', title: '组六单式', description: '手动输入一个3位数号码组成一注，开奖号码的百位、十位、个位相同，顺序不限，且符合组六为中奖。', example: '投注方案：2,5,8；开奖号码后三位：1个2、1个5、1个8 (顺序不限)，即中后三组六。'},
        //         {id: '-3-2-5', title: '混合组选', description: '手动输入一个3位数号码组成一注(不含豹子号)，开奖号码的百位、十位、个位符合后三组三或组六均为中奖。', example: '投注方案：分別投注(0,0,1),以及(1,2,3)，开奖号码后三位包括：(1)0,0,1，顺序不限，即中得组三；或者(2)1,2,3，顺序不限，即中得组六。'}
        //       ]
        //     },
        //     {
        //       title: '后三其它',
        //       items: [
        //         {id: '-3-3-1', title: '和值', description: '所选数值等于开奖号码百位、十位、个位三个数字相加之和(不含豹子号)，即为中奖。', example: '投注方案：和值3；开奖号码后三位：(1)开出003号码，顺序不限，即中后三组三；(2)开出012号码，顺序不限，即中后三组六。'},
        //         {id: '-3-3-2', title: '包胆', description: '从0-9中任意选择1个包胆号码，开奖号码的百位、十位、个位中任意1位只要和所选包胆号码相同(不含豹子号)，即为中奖。', example: '投注方案：包胆3；开奖号码后三位：(1)出现3xx或者33x,即中后三组三；(2)出现3xy，即中后三组六。'},
        //         {id: '-3-3-3', title: '和值尾数', description: '所选数值等于开奖号码的百位、十位、个位三个数字相加之和的尾数，即为中奖。', example: '投注方案：和值尾数8，开奖号码：后三位和值尾数为8，即中得和值尾数。'},
        //         {id: '-3-3-4', title: '特殊号', description: '所选的号码特殊属性和开奖号码中间3位的属性一致，即为中奖。其中：1.豹子号指的是开奖号码的后三位当中，三位数号码数字全部相同；2.顺子号的万、千、百位不分顺序(特别号码：019、089也是顺子号)；3.对子号指的是开奖号码的后三位当中，任意2位数字相同的三位数号码', example: '豹子；开奖号码后三位：三个数字全部相同，即中得豹子，顺子；开奖号码后三位：为连续数字，例如678，即中得顺子。对子；开奖号码中三位：3个数字中有2个数字相同，即中得对子'}
        //       ]
        //     }
        //   ]
        // },
        // {
        //   title: '二星',
        //   groups: [
        //     {
        //       title: '前二直选',
        //       items: [
        //         {id: '2-1-1', title: '直选复式', description: '从万位、千位中选择一个2位数号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。 ', example: '投注方案：58；开奖号码前二位：58，即中前二直选。'},
        //         {id: '2-1-2', title: '直选单式', description: '手动输入一个2位数号码组成一注，所选号码的万位、千位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：58；开奖号码前二位：58，即中前二直选。'},
        //         {id: '2-1-3', title: '直选跨度', description: '所选数值等于开奖号码的前2位最大与最小数字相减之差，即为中奖。', example: '投注方案：跨度9；开奖号码为9,0,-,-,-或0,9,-,-,-，即中前二直选。'}
        //       ]
        //     },
        //     {
        //       title: '前二组选',
        //       items: [
        //         {id: '2-2-1', title: '组选复式', description: '从0-9中选2个号码组成一注，所选号码与开奖号码的万位、千位相同，顺序不限（不含对子号），即中奖。 ', example: '投注方案：5,8；开奖号码前二位：85 或58(顺序不限，不含对子号)，即中前二组选。'},
        //         {id: '2-2-2', title: '组选单式', description: '手动输入一个2位数号码组成一注，所选号码的万位、千位与开奖号码相同，顺序不限（不含对子号），即为中奖。', example: '投注方案：5,8；开奖号码前二位：85 或58(顺序不限，不含对子号)，即中前二组选。'},
        //         {id: '2-2-3', title: '组选包胆', description: '从0-9中任意选择1个包胆号码，开奖号码的万位、千位中任意1位包含所选的包胆号码相同（不含对子号），即为中奖。', example: '投注方案：包胆号码8；开奖号码前二位：出现1个8（不包括2个8），即中前二组选。'}
        //       ]
        //     },
        //     {
        //       title: '后二直选',
        //       items: [
        //         {id: '2-3-1', title: '直选复式', description: '从十位、个位中选择一个2位数号码组成一注，所选号码与开奖号码的后2位相同，且顺序一致，即为中奖。 ', example: '投注方案：58；开奖号码后二位：58，即中后二直选。'},
        //         {id: '2-3-2', title: '直选单式', description: '手动输入一个2位数号码组成一注，所选号码的十位、个位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：58；开奖号码后二位：58，即中后二直选。'},
        //         {id: '2-3-3', title: '直选跨度', description: '所选数值等于开奖号码的后2位最大与最小数字相减之差，即为中奖。', example: '投注方案：跨度9；开奖号码为9,0,-,-,-或0,9,-,-,-，即中后二直选。'}
        //       ]
        //     },
        //     {
        //       title: '后二组选',
        //       items: [
        //         {id: '2-4-1', title: '组选复式', description: '从0-9中选2个号码组成一注，所选号码与开奖号码的十位、个位相同，顺序不限（不含对子号），即中奖。 ', example: '投注方案：5,8；开奖号码后二位：85 或58(顺序不限，不含对子号)，即中后二组选。'},
        //         {id: '2-4-2', title: '组选单式', description: '手动输入一个2位数号码组成一注，所选号码的十位、个位与开奖号码相同，顺序不限（不含对子号），即为中奖。', example: '投注方案：5,8；开奖号码后二位：85 或58(顺序不限，不含对子号)，即中后二组选。'},
        //         {id: '2-4-3', title: '组选包胆', description: '从0-9中任意选择1个包胆号码，开奖号码的十位、个位中任意1位包含所选的包胆号码相同（不含对子号），即为中奖。', example: '投注方案：包胆号码8；开奖号码后二位：出现1个8（不包括2个8），即中后二组选。'}
        //       ]
        //     }
        //   ]
        // },
        {
          title: '三星',
          groups: [
            {
              title: '直选',
              items: [
                {id: '+3-1-1', title: '直选复式', description: '从万位、千位、百位中选择一个3位数号码组成一注，所选号码与开奖号码的前3位相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码前三位：345，即中前三直选。'},
                {id: '+3-1-2', title: '直选单式', description: '手动输入一个3位数号码组成一注，所选号码的万位、千位、百位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：345； 开奖号码前三位：345，即中前三直选。'},
                {id: '+3-1-3', title: '直选和值', description: '所选数值等于开奖号码的万位、千位、百位三个数字相加之和，即为中奖。', example: '投注方案：和值1；开奖号码前三位：001,010,100,即中前三直选。'}
              ]
            },
            {
              title: '组选',
              items: [
                {id: '+3-2-1', title: '组三复式', description: '从0-9中选择2个数字组成两注，所选号码与开奖号码的万位、千位、百位相同，且顺序不限，即为中奖。 ', example: '投注方案：5,8,8；开奖号码前三位：1个5，2个8 (顺序不限)，即中前三组三'},
                {id: '+3-2-2', title: '组三单式', description: '手动输入一个3位数号码组成一注，开奖号码的万位、千位、百位相同，顺序不限，且符合组三为中奖。', example: '投注方案：5,8,8；开奖号码前三位：1个5，2个8 (顺序不限)，即中前三组三'},
                {id: '+3-2-3', title: '组六复式', description: '从0-9中任意选择3个号码组成一注，所选号码与开奖号码的万位、千位、百位相同，顺序不限，即为中奖。', example: '投注方案：2,5,8；开奖号码前三位：1个2、1个5、1个8 (顺序不限)，即中前三组六。'},
                {id: '+3-2-4', title: '组六单式', description: '手动输入一个3位数号码组成一注，开奖号码的万位、千位、百位相同，顺序不限，且符合组六为中奖。', example: '投注方案：2,5,8；开奖号码前三位：1个2、1个5、1个8 (顺序不限)，即中前三组六。'},
                {id: '+3-2-5', title: '混合组选', description: '手动输入一个3位数号码组成一注(不含豹子号)，开奖号码的万位、千位、百位符合后三组三或组六均为中奖', example: '投注方案：分別投注(0,0,1),以及(1,2,3)，开奖号码前三位包括：(1)0,0,1，顺序不限，即中得组三；或者(2)1,2,3，顺序不限，即中得组六。'},
                {id: '+3-3-1', title: '和值(不含豹子号)', description: '所选数值等于开奖号码万位、千位、百位三个数字相加之和(不含豹子号)，即为中奖。', example: '投注方案：和值3；开奖号码前三位：(1)开出003号码，顺序不限，即中前三组三；(2)开出012号码，顺序不限，即中前三组六。'}
              ]
            }
          ]
        },
        {
          title: '二星',
          groups: [
            {
              title: '前二直选',
              items: [
                {id: '2-1-1', title: '直选复式', description: '从万位、千位中选择一个2位数号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。 ', example: '投注方案：58；开奖号码前二位：58，即中前二直选。'},
                {id: '2-1-2', title: '直选单式', description: '手动输入一个2位数号码组成一注，所选号码的万位、千位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：58；开奖号码前二位：58，即中前二直选。'}
              ]
            },
            {
              title: '前二组选',
              items: [
                {id: '2-2-1', title: '组选复式', description: '从0-9中选2个号码组成一注，所选号码与开奖号码的万位、千位相同，顺序不限（不含对子号），即中奖。 ', example: '投注方案：5,8；开奖号码前二位：85 或58(顺序不限，不含对子号)，即中前二组选。'},
                {id: '2-2-2', title: '组选单式', description: '手动输入一个2位数号码组成一注，所选号码的万位、千位与开奖号码相同，顺序不限（不含对子号），即为中奖。', example: '投注方案：5,8；开奖号码前二位：85 或58(顺序不限，不含对子号)，即中前二组选。'}
              ]
            },
            {
              title: '后二直选',
              items: [
                {id: '2-3-1', title: '直选复式', description: '从十位、个位中选择一个2位数号码组成一注，所选号码与开奖号码的后2位相同，且顺序一致，即为中奖。 ', example: '投注方案：58；开奖号码后二位：58，即中后二直选。'},
                {id: '2-3-2', title: '直选单式', description: '手动输入一个2位数号码组成一注，所选号码的十位、个位与开奖号码相同，且顺序一致，即为中奖。', example: '投注方案：58；开奖号码后二位：58，即中后二直选。'}
              ]
            },
            {
              title: '后二组选',
              items: [
                {id: '2-4-1', title: '组选复式', description: '从0-9中选2个号码组成一注，所选号码与开奖号码的十位、个位相同，顺序不限（不含对子号），即中奖。 ', example: '投注方案：5,8；开奖号码后二位：85 或58(顺序不限，不含对子号)，即中后二组选。'},
                {id: '2-4-2', title: '组选单式', description: '手动输入一个2位数号码组成一注，所选号码的十位、个位与开奖号码相同，顺序不限（不含对子号），即为中奖。', example: '投注方案：5,8；开奖号码后二位：85 或58(顺序不限，不含对子号)，即中后二组选。'}
              ]
            }
          ]
        },
        {
          title: '一星',
          groups: [
            {
              title: '',
              items: [
                {id: '1-1-1', title: '定位胆', description: '从万位、千位、百位、十位、个位任意位置上至少选择1个以上号码，所选号码与相同位置上的开奖号码一致，即为中奖。', example: '投注方案：万位 1；开奖号码万位：1，即中定位胆万位。'}
              ]
            }
          ]
        },
        {
          title: '不定位',
          groups: [
            {
              title: '',
              items: [
                {id: '0-1-1', title: '一码不定位', description: '从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的万位、千位、百位中包含所选号码，即为中奖', example: '投注方案：1；开奖号码前三位：至少出现1个1，即中前三一码不定位。'},
                {id: '0-1-2', title: '二码不定位', description: '从0-9中选择2个号码，每注由2个不同的号码组成，开奖号码的万位、千位、百位中同时包含所选的2个号码，即为中奖', example: '投注方案：1,2；开奖号码前三位：至少出现1和2各1个，即中前三二码不定位。'}
              ]
            }
          ]
        },
        {
          title: '趣味',
          groups: [
            {
              title: '大小单双',
              items: [
                {id: '-2-1-1', title: '前二大小单双', description: '对万位、千位的“大（56789）小（01234）、单（13579）双（02468）”形态进行购买，所选号码的位置、形态与开奖号码的位置、形态相同，即为中奖。', example: '投注方案：小双；开奖号码万位与千位：小双，即中前二大小单双。'},
                {id: '-2-1-2', title: '后二大小单双', description: '对十位和个位的“大（56789）小（01234）、单（13579）双（02468）”形态进行购买，所选号码的位置、形态与开奖号码的位置、形态相同，即为中奖。', example: '投注方案：大单；开奖号码十位与个位：大单，即中后二大小单双。'}
              ]
            }
          ]
        }
      ],
      getTitle () {
        switch (this.type.id.slice(0, 2)) {
          // case '5-':
          //   return '五星'
          // case '4-':
          //   return '四星'
          // case '3-':
          //   return '中三'
          // case '-3':
          //   return '后三'
          case '+3':
            return '三星'
          case '2-':
            return '二星'
          case '1-':
            return '一星'
          case '0-':
            return '不定位'
          case '-1':
            return '任选'
          case '-2':
            return '趣味'
        }
      },
      // 玩法信息
      type: {
        id: '+3-1-1',
        // 玩法名
        title: '',
        // 玩法描述
        description: ''
      }
    }
  }
}
</script>
