<template lang="jade">
  .help-page
    slot(name="cover")
    slot(name="movebar")
    slot(name="resize-x")
    slot(name="resize-y")
    slot(name="toolbar")

    .scroll-content.vip-introduction
      pre
        p.text-bold.text-center 畅博娱乐VIP制度
        br

        | 高额存提通道√      专属VIP客服√      稳定游戏专线√      专属定制活动√      问题优先处理√  

        br
        br
        p.text-bold 畅博VIP至尊特权
        br
        | 特权待遇  VIP1          VIP2           VIP3           VIP4         VIP5
        | 专属客服   √            √             √             √           √
        | 游戏专线   √            √             √             √           √
        | 优先特权   √            √             √             √           √
        br
        br
        p.text-bold充提特权（优先处理，充值次数不限，提款次数最多5次）
        br 
        | VIP1      充值单笔最低100元,单笔最高10万元; 提款单笔最低100元, 单笔最高8万元
        | VIP1      充值单笔最低100元,单笔最高20万元; 提款单笔最低100元, 单笔最高10万元
        | VIP1      充值单笔最低100元,单笔最高30万元; 提款单笔最低100元, 单笔最高15万元
        | VIP1      充值单笔最低100元,单笔最高40万元; 提款单笔最低100元, 单笔最高15万元
        | VIP1      充值单笔最低100元,单笔最高50万元; 提款单笔最低100元, 单笔最高15万元
        br
        br        
  
   

      
        p.text-bold 畅博VIP晋升途径一
        br
        | VIP等级     提出VIP申请前7日内             提出VIP申请前15日内            提出VIP申请前30日内 
        | VIP1      完成10万存款及20万投注额      完成15万存款及30万投注额       完成20万存款及50万投注额
        | VIP2      完成15万存款及30万投注额      完成25万存款及50万投注额       完成30万存款及75万投注额
        | VIP3      完成20万存款及40万投注额      完成35万存款及70万投注额       完成40万存款及100万投注额
        | VIP4      完成25万存款及50万投注额      完成45万存款及90万投注额       完成50万存款及125万投注额
        | VIP5      完成30万存款及60万投注额      完成55万存款及110万投注额      完成60万存款及150万投注额
        br
        br

        p.text-bold 畅博VIP晋升途径二
        br
        | 由VIP会员或直属及以上直接推荐，推荐人与被推荐人不能共用同一账户、同一IP以及同一姓名银行卡信息。
        br
        br

        p.text-bold 保级条件
        br 
        | VIP1      一个月内完成40万投注额
        | VIP2      一个月内完成60万投注额
        | VIP3      一个月内完成80万投注额
        | VIP4      一个月内完成100万投注额
        | VIP5      一个月内完成120万投注额
        br
        br
        p.text-grey
          | 注：所有VIP会员的保级考核从成为VIP所在月份的下一个月开始进行统计；每个月前两个工作日内完成VIP资格更新。
          | 例：玩家在11月10日申请VIP并成功晋升，则11月10日 至 11月31日期间均可享受VIP特权；12月1日至12月31日开始针对该会员进行VIP保级考核；1月1日至1月2日完成所有VIP资格更新。
        br
        p.text-bold 常见问题：
        br
        | (1. 是否存在“直属及以上级别推荐”？
        br
        | 答： 是的，直属及以上推荐的名单可直接为VIP1。 
        br
        br
        | (2. 通过推荐方式晋级的账户是可否越级成为高等级VIP？比如 直属及以上或平台VIP推荐的账户直接晋级成为VIP5?
        | 答：通过“推荐方式”成为VIP的账户，首次晋级仅可成为VIP1。（但VIP1首次通过考核且达到VIP5标准，可申请越级，即VIP1可升级成为VIP5）
        br
        br
        | (3. 如达到晋级标准，平台是否会直接升级该账户？
        | 答： 对达到晋级标准的VIP账户，平台会以系统消息的形式通知至各位，玩家如有意愿进行升级可联系平台客服进行申请，方后平台将会予以升级。
        br
        br
        | (4. 怎样的情况下，会予以降级或者取消VIP资格？
        | 答：连续3个月未达到对应保级标准的VIP账户，平台将对应进行降级或取消VIP资格。
        br
        br 
        | (5. 每月审核，是以个人充值量和投注量为标准，还是以团队充值量和投注量为审核标准?
        | 答：对于VIP账户，平台统一以个人的充值量和投注量为标准进行相关审核。




    
</template>


<style lang="stylus" scoped>
  @import '../../var.stylus'
  .help-page
      min-width 8rem
  .vip-introduction
    top TH
    padding PWX
    font-size .16rem
  
</style>
